IDENTIFICATION DIVISION.
PROGRAM-ID. QUIZ.
ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT INDATA ASSIGN TO 'questions.dat'
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INDATA.
01 FS-QTABLE.
  05 FS-PROMPT PIC X(30).
  05 FS-ATABLE.
    10 FS-ANSWERS PIC X(10) OCCURS 4 TIMES.
  05 FS-CORRECT PIC 9.
WORKING-STORAGE SECTION.
01 WS-QUESTION.
  05 WS-PROMPT PIC X(30).
  05 WS-ATABLE.
    10 WS-ANSWER PIC X(10) OCCURS 4 TIMES.
  05 WS-CORRECT PIC 9.

01 WS-NUMQS PIC 99 VALUE 5.
01 WS-SCORE PIC 99 VALUE 0.
01 WS-QNUM PIC 99 VALUE 0.
01 WS-SELECT PIC 9.
01 WS-EOF PIC A.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
  OPEN INPUT INDATA
    PERFORM UNTIL WS-EOF='Y'
      READ INDATA INTO WS-QUESTION
        AT END MOVE 'Y' TO WS-EOF
        NOT AT END PERFORM ASKPARA
      END-READ
    END-PERFORM
  CLOSE INDATA.
  DISPLAY "Your score: " WS-SCORE " out of " WS-NUMQS
STOP RUN.

ASKPARA.
  ADD 1 TO WS-QNUM.
  DISPLAY "Question " WS-QNUM.
  DISPLAY WS-PROMPT.
  DISPLAY "1) " WS-ANSWER(1).
  DISPLAY "2) " WS-ANSWER(2).
  DISPLAY "3) " WS-ANSWER(3).
  DISPLAY "4) " WS-ANSWER(4).
  ACCEPT WS-SELECT.
  IF WS-CORRECT = WS-SELECT
    DISPLAY "Correct!"
    ADD 1 TO WS-SCORE
  ELSE
    DISPLAY "Wrong!"
  END-IF.
  DISPLAY " ".

END PROGRAM QUIZ.
