IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 INVAR PIC 99.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "Hello, world".
    ACCEPT INVAR.
    DISPLAY INVAR.
    STOP RUN.
END PROGRAM HELLO.
