IDENTIFICATION DIVISION.
PROGRAM-ID. REPORT.
ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT LABELFILE ASSIGN TO 'labels.dat'
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
  FILE SECTION.
    FD LABELFILE.
    01 FS-LABENTRY.
      05 FSE-LABEL PIC X(20).

  WORKING-STORAGE SECTION.
    01 NUMLABELS PIC 99 VALUE 8.
    01 WS-EOF PIC A.
    01 WS-COUNT PIC 99.

    01 WS-LABELS.
      05 WS-LABEL PIC X(20) OCCURS DEPENDING ON NUMLABELS.

    01 WS-LABENTRY.
      05 WSL-LABEL PIC X(20).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
  OPEN INPUT LABELFILE
    PERFORM UNTIL WS-EOF='Y'
      READ LABELFILE INTO WS-LABELS
        AT END MOVE 'Y' TO WS-EOF
        NOT AT END
          ADD 1 TO WS-COUNT
          MOVE WSL-LABEL TO WS-LABEL
          (WS-COUNT)
      END-READ
    END-PERFORM
  CLOSE LABELFILE
  DISPLAY WSL-LABEL
STOP RUN.
END PROGRAM REPORT.
