IDENTIFICATION DIVISION.
PROGRAM-ID. LEDGER.
ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT TRANSACTIONS ASSIGN TO 'transactions.txt'
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
  FILE SECTION.
    FD TRANSACTIONS.
    01 FS-ENTRY.
      05 FSE-IGNORE PIC A.
      05 FSE-YEAR PIC 9999.
      05 FSE-MONTH PIC 99.
      05 FSE-DAY PIC 99.
      05 FSE-MODE PIC 9.
      05 FSE-FROM PIC 9.
      05 FSE-TO PIC 9.
      05 FSE-AMNT PIC S9(6)V99.
      05 FSE-COMMENT PIC A(30).
  WORKING-STORAGE SECTION.
    01 WS-ENTRY.
      05 WSE-IGNORE PIC A.
      05 WSE-YEAR PIC 9999.
      05 WSE-MONTH PIC 99.
      05 WSE-DAY PIC 99.
      05 WSE-MODE PIC 9.
      05 WSE-FROM PIC 9.
      05 WSE-TO PIC 9.
      05 WSE-AMNT PIC S9(6)V99.
      05 WSE-COMMENT PIC A(30).
    01 WS-EOF PIC A.

    01 TD PIC 9 VALUE 1.
    01 CHIME PIC 9 VALUE 2.
    01 INVESTED PIC 9 VALUE 3.
    01 SAVINGS PIC 9 VALUE 4.

    01 MISC PIC 9 VALUE 1.
    01 RENT PIC 9 VALUE 2.
    01 UTILITY PIC 9 VALUE 3.
    01 DINING PIC 9 VALUE 4.
    01 GROCERY PIC 9 VALUE 5.
    01 DAB PIC 9 VALUE 6.
    01 NIC PIC 9 VALUE 7.
    01 ALC PIC 9 VALUE 8.

    01 WS-ASSETS.
      05 WS-A PIC S9(6)V99 OCCURS 4 TIMES.
    01 WS-EXPENSES.
      05 WS-E PIC S9(6)V99 OCCURS 8 TIMES.

    01 WS-INP-A PIC 9.
    01 WS-INP-B PIC 9.
    01 WS-INP-AMNT PIC S9(6)V99.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
  MOVE 700.00 TO WS-A(TD).
  MOVE 150.00 TO WS-A(CHIME).
  MOVE 1000.00 TO WS-A(INVESTED).
  MOVE 0 TO WS-A(SAVINGS).
  DISPLAY "|ledger|"
  PERFORM SHOW_ACCOUNTS
  DISPLAY " "
  OPEN INPUT TRANSACTIONS
    PERFORM UNTIL WS-EOF='Y'
      READ TRANSACTIONS INTO WS-ENTRY
        AT END MOVE 'Y' TO WS-EOF
        NOT AT END PERFORM TRANSACT_ENTRY
      END-READ
    END-PERFORM
  CLOSE TRANSACTIONS.
  PERFORM SHOW_ACCOUNTS
STOP RUN.

TRANSACT_ENTRY.
  IF WSE-IGNORE IS NOT = '*' THEN
    DISPLAY WSE-COMMENT
    DISPLAY "   YEAR " WSE-YEAR
    DISPLAY "  MONTH " WSE-MONTH
    DISPLAY "    DAY " WSE-DAY
    DISPLAY "   MODE " WSE-MODE
    DISPLAY "   FROM " WSE-FROM
    DISPLAY "     TO " WSE-TO
    DISPLAY " AMOUNT " WSE-AMNT
    IF WSE-MODE = 1 THEN
      SUBTRACT WSE-AMNT FROM WS-A(WSE-FROM)
      ADD WSE-AMNT TO WS-E(WSE-TO)
    ELSE
      COMPUTE WS-A(WSE-FROM) = (WS-A(WSE-FROM) - WSE-AMNT)
      COMPUTE WS-A(WSE-TO) = (WS-A(WSE-TO) + WSE-AMNT)
    END-IF
  ELSE
    DISPLAY WS-ENTRY
  END-IF.

TRANSACT_AE_ASK.
  DISPLAY "Enter asset number"
  ACCEPT WS-INP-A
  DISPLAY "Enter expense number"
  ACCEPT WS-INP-B
  DISPLAY "Enter transaction amount"
  ACCEPT WS-INP-AMNT
  COMPUTE WS-A(WS-INP-A) = (WS-A(WS-INP-A) - WS-INP-AMNT)
  COMPUTE WS-E(WS-INP-B) = (WS-E(WS-INP-B) + WS-INP-AMNT).

TRANSACT_AA_ASK.
  DISPLAY "Enter asset from"
  ACCEPT WS-INP-A
  DISPLAY "Enter asset to"
  ACCEPT WS-INP-B
  DISPLAY "Enter transaction amount"
  ACCEPT WS-INP-AMNT
  COMPUTE WS-A(WS-INP-A) = (WS-A(WS-INP-A) - WS-INP-AMNT)
  COMPUTE WS-A(WS-INP-B) = (WS-A(WS-INP-B) + WS-INP-AMNT).

SHOW_ACCOUNTS.
  PERFORM SHOW_ASSETS
  DISPLAY " "
  PERFORM SHOW_EXPENSES.

SHOW_ASSETS.
  DISPLAY "1-TD       2-CHIME    3-INVESTED 4-SAVINGS "
  DISPLAY "---------- ---------- ---------- ----------"
  DISPLAY WS-A(1) " " WS-A(2) " " WS-A(3) " " WS-A(4).

SHOW_EXPENSES.
  DISPLAY "1-MISC     2-RENT     3-UTILITY  4-DINING   5-GROCERY  6-DAB      7-NIC      8-ALC     "
  DISPLAY "---------- ---------- ---------- ---------- ---------- ---------- ---------- ----------"
  DISPLAY WS-E(1) " " WS-E(2) " " WS-E(3) " " WS-E(4) " " WS-E(5) " " WS-E(6) " " WS-E(7) " " WS-E(8).
