IDENTIFICATION DIVISION.
PROGRAM-ID. FILES.
ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT INDATA ASSIGN TO 'indata.txt'
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
  FILE SECTION.
  FD INDATA.
  01 FS-ENTRY.
    05 FS-NAME PIC A(25).
    05 FS-COUNT PIC 9(20).

  WORKING-STORAGE SECTION.
  01 WS-ENTRY.
    05 WS-NAME PIC A(25).
    05 WS-COUNT PIC 9(20).
  01 WS-EOF PIC A.


PROCEDURE DIVISION.
MAIN-PROCEDURE.
  OPEN INPUT INDATA
    PERFORM UNTIL WS-EOF='Y'
      READ INDATA INTO WS-ENTRY
        AT END MOVE 'Y' TO WS-EOF
        NOT AT END DISPLAY WS-ENTRY
      END-READ
    END-PERFORM
  CLOSE INDATA.
STOP RUN.
END PROGRAM FILES.
