IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 N PIC 99.
01 A PIC 99.
01 R1 PIC 9.
01 R2 PIC 9.
PROCEDURE DIVISION.
B-PARA.
    DIVIDE N BY 3 GIVING A REMAINDER R1
    DIVIDE N BY 5 GIVING A REMAINDER R2
    IF R1 = 0 THEN
        IF R2 = 0 THEN
            DISPLAY "FI ZZBUZZ"
        ELSE
            DISPLAY "FIZZ"
        END-IF
    ELSE
        IF R2 = 0 THEN
            DISPLAY "BUZZ"
        ELSE
            DISPLAY N
        END-IF
    END-IF.

MAIN-PROCEDURE.
    DISPLAY "FIZZBUZZ"
    PERFORM B-PARA VARYING N FROM 1 BY 1 UNTIL N=16
    STOP RUN.
END PROGRAM FIZZBUZZ.
