IDENTIFICATION DIVISION.
PROGRAM-ID. READSEQ.
ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
    FILE CONTROL.

DATA DIVISION.
  FILE SECTION.
  FD recseqv
    RECORDING MODE IS V
    RECORD VARYING FROM 3 TO 80 CHARACTERS.
  01 recseqv-fd-record  PIC X
    OCCURS 3 TO 80 TIMES DEPENDING ON ws-record-length.
WORKING-STORAGE SECTION.
  01 ws-record-length   PIC 99.
